ab-result/http1.1.log
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.201 (be patient)
Completed 20000 requests
Completed 40000 requests
Completed 60000 requests
Completed 80000 requests
Completed 100000 requests
Completed 120000 requests
Completed 140000 requests
Completed 160000 requests
Completed 180000 requests
Completed 200000 requests
Finished 200000 requests


Server Software:        nginx/1.21.4
Server Hostname:        192.168.2.201
Server Port:            60080

Document Path:          /http1.1
Document Length:        34 bytes

Concurrency Level:      100
Time taken for tests:   8.603 seconds
Complete requests:      200000
Failed requests:        0
Keep-Alive requests:    199840
Total transferred:      36399200 bytes
HTML transferred:       6800000 bytes
Requests per second:    23247.32 [#/sec] (mean)
Time per request:       4.302 [ms] (mean)
Time per request:       0.043 [ms] (mean, across all concurrent requests)
Transfer rate:          4131.76 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0      11
Processing:     0    4   4.3      4      32
Waiting:        0    4   4.3      4      32
Total:          0    4   4.3      4      32

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      6
  75%      8
  80%      8
  90%     10
  95%     12
  98%     14
  99%     16
 100%     32 (longest request)