ab-result/nginx10.log
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.201 (be patient)
Completed 20000 requests
Completed 40000 requests
Completed 60000 requests
Completed 80000 requests
Completed 100000 requests
Completed 120000 requests
Completed 140000 requests
Completed 160000 requests
Completed 180000 requests
Completed 200000 requests
Finished 200000 requests


Server Software:        nginx/1.21.4
Server Hostname:        192.168.2.201
Server Port:            60010

Document Path:          /
Document Length:        615 bytes

Concurrency Level:      100
Time taken for tests:   90.491 seconds
Complete requests:      200000
Failed requests:        0
Keep-Alive requests:    199842
Total transferred:      170599210 bytes
HTML transferred:       123000000 bytes
Requests per second:    2210.16 [#/sec] (mean)
Time per request:       45.246 [ms] (mean)
Time per request:       0.452 [ms] (mean, across all concurrent requests)
Transfer rate:          1841.07 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.6      0      49
Processing:     6   45  34.8     33    1055
Waiting:        5   45  34.8     33    1055
Total:          6   45  34.8     33    1055

Percentage of the requests served within a certain time (ms)
  50%     33
  66%     36
  75%     39
  80%     42
  90%     93
  95%    112
  98%    183
  99%    204
 100%   1055 (longest request)